# IExternalCommandAvailability Methods

---
The IExternalCommandAvailability type exposes the following members.
| Name| Description
---|---|---
| IsCommandAvailable|  Implement this method to provide control over whether your external command is enabled or disabled.
Top
#### Reference
IExternalCommandAvailability Interface
Autodesk.Revit.UI Namespace